jpc007/stm32n6570-dk-first/FSBL/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32n6xx_hal_ltdc.h"
#include "stm32n6xx_hal_rif.h"
#include <string.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define APPLI_SECURE_ADDR  0x34000400U   /* AppliSecure vector table in SRAM1 */

/* RK050HR18 + FB — meme constantes que milestone git 862acf5 (FSBL LCD rouge HAL). */
#define FSBL_LCD_WIDTH   800U
#define FSBL_LCD_HEIGHT  480U
#define FSBL_LCD_HSYNC   4U
#define FSBL_LCD_HBP     4U
#define FSBL_LCD_HFP     4U
#define FSBL_LCD_VSYNC   4U
#define FSBL_LCD_VBP     4U
#define FSBL_LCD_VFP     4U
#define FSBL_FB_ADDRESS  0x34200000U    /* SRAM3 alias Secure (LTDC DMA) */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

MDF_HandleTypeDef MdfHandle0;
MDF_FilterConfigTypeDef MdfFilterConfig0;

SAI_HandleTypeDef hsai_BlockA1;
SAI_HandleTypeDef hsai_BlockB1;

SD_HandleTypeDef hsd2;

UART_HandleTypeDef huart1;

HCD_HandleTypeDef hhcd_USB_OTG_HS2;

XSPI_HandleTypeDef hxspi1;
XSPI_HandleTypeDef hxspi2;

/* USER CODE BEGIN PV */
LTDC_HandleTypeDef       hltdc;
static UART_HandleTypeDef huart2;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_MDF1_Init(void);
static void MX_SAI1_Init(void);
static void MX_SDMMC2_SD_Init(void);
static void MX_UCPD1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USB1_OTG_HS_HCD_Init(void);
static void MX_USB2_OTG_HS_HCD_Init(void);
static void MX_XSPI1_Init(void);
static void MX_XSPI2_Init(void);
/* USER CODE BEGIN PFP */
static void Security_Config(void);
static void SRAM_Enable(void);
static void USART2_Init(void);
static void UART_Print(const char *msg);
static void UART_PrintResetCause(void);
static void Jump_To_AppliSecure(void);
static void FSBL_LTDC_ClockConfig(void);
static void FSBL_LTDC_Init_Red_Milestone862acf5(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* ------------------------------------------------------------------ */
/* UART helper                                                        */
/* ------------------------------------------------------------------ */
static void UART_Print(const char *msg)
{
  HAL_UART_Transmit(&huart2, (const uint8_t *)msg,
                    (uint16_t)strlen(msg), 200);
}
static void UART_PrintHex32(uint32_t v)
{
  char h[9];
  for (int i = 7; i >= 0; i--) {
    uint8_t n = (v >> (i*4)) & 0xF;
    h[7-i] = n < 10 ? '0'+n : 'A'+n-10;
  }
  h[8] = '\0';
  UART_Print(h);
}

/* Cause du reset precedent (RCC->RSR) — utile quand la trace reprend au FSBL apres long run NS */
static void UART_PrintResetCause(void)
{
  const uint32_t r = RCC->RSR;
  UART_Print("[FSBL] Reset cause RCC->RSR=0x");
  UART_PrintHex32(r);
  UART_Print(" [");
  if ((r & RCC_RSR_LCKRSTF) != 0U) {
    UART_Print("LCKUP ");
  }
  if ((r & RCC_RSR_BORRSTF) != 0U) {
    UART_Print("BOR ");
  }
  if ((r & RCC_RSR_PINRSTF) != 0U) {
    UART_Print("NRST ");
  }
  if ((r & RCC_RSR_PORRSTF) != 0U) {
    UART_Print("POR ");
  }
  if ((r & RCC_RSR_SFTRSTF) != 0U) {
    UART_Print("SW ");
  }
  if ((r & RCC_RSR_IWDGRSTF) != 0U) {
    UART_Print("IWDG ");
  }
  if ((r & RCC_RSR_WWDGRSTF) != 0U) {
    UART_Print("WWDG ");
  }
  if ((r & RCC_RSR_LPWRRSTF) != 0U) {
    UART_Print("LPWR ");
  }
  UART_Print("]\r\n");
  /* Effacer pour le prochain cycle (RM : bit RMVF) */
  RCC->RSR |= RCC_RSR_RMVF;
}

/* ------------------------------------------------------------------ */
/* USART2 TX on PD5 (AF7) — debug trace                              */
/* ------------------------------------------------------------------ */
static void USART2_Init(void)
{
  RCC_PeriphCLKInitTypeDef pclk = {0};
  GPIO_InitTypeDef gpio = {0};

  pclk.PeriphClockSelection = RCC_PERIPHCLK_USART2;
  pclk.Usart2ClockSelection = RCC_USART2CLKSOURCE_CLKP;
  HAL_RCCEx_PeriphCLKConfig(&pclk);
  __HAL_RCC_USART2_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  gpio.Pin       = GPIO_PIN_5;
  gpio.Mode      = GPIO_MODE_AF_PP;
  gpio.Pull      = GPIO_NOPULL;
  gpio.Speed     = GPIO_SPEED_FREQ_LOW;
  gpio.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(GPIOD, &gpio);

  huart2.Instance          = USART2;
  huart2.Init.BaudRate     = 115200;
  huart2.Init.WordLength   = UART_WORDLENGTH_8B;
  huart2.Init.StopBits     = UART_STOPBITS_1;
  huart2.Init.Parity       = UART_PARITY_NONE;
  huart2.Init.Mode         = UART_MODE_TX;
  huart2.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  HAL_UART_Init(&huart2);
}

