jpc007/stm32n6570-dk-first/FSBL/Core/Src/main.c
/* ------------------------------------------------------------------ */
/* LTDC pixel clock — meme principe que milestone 862acf5 :
 *   IC16 source PLL4, div 24  => 600 MHz / 24 = 25 MHz (RK050HR18)    */
/* ------------------------------------------------------------------ */
static void FSBL_LTDC_ClockConfig(void)
{
  RCC_PeriphCLKInitTypeDef pclk = {0};

  pclk.PeriphClockSelection                   = RCC_PERIPHCLK_LTDC;
  pclk.LtdcClockSelection                     = RCC_LTDCCLKSOURCE_IC16;
  pclk.ICSelection[RCC_IC16].ClockSelection     = RCC_ICCLKSOURCE_PLL4;
  pclk.ICSelection[RCC_IC16].ClockDivider     = 24U;
  if (HAL_RCCEx_PeriphCLKConfig(&pclk) != HAL_OK) {
    UART_Print("[FSBL-LTDC] RCC IC16 FAILED\r\n");
  }
}

/* HAL_LTDC_MspInit — copie fonctionnelle du FSBL @862acf5 (BSP RK050) */
void HAL_LTDC_MspInit(LTDC_HandleTypeDef *hltdc_arg)
{
  GPIO_InitTypeDef gpio = {0};
  (void)hltdc_arg;

  __HAL_RCC_LTDC_CLK_ENABLE();
  __HAL_RCC_LTDC_FORCE_RESET();
  __HAL_RCC_LTDC_RELEASE_RESET();

  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOQ_CLK_ENABLE();

  gpio.Mode      = GPIO_MODE_AF_PP;
  gpio.Pull      = GPIO_NOPULL;
  gpio.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio.Alternate = GPIO_AF14_LCD;

  gpio.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOA, &gpio);

  gpio.Pin = GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOB, &gpio);

  gpio.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOD, &gpio);

  gpio.Pin = GPIO_PIN_11;
  HAL_GPIO_Init(GPIOE, &gpio);

  gpio.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_6 | GPIO_PIN_8 | GPIO_PIN_11 | GPIO_PIN_12;
  HAL_GPIO_Init(GPIOG, &gpio);

  gpio.Pin = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_6;
  HAL_GPIO_Init(GPIOH, &gpio);

  __HAL_RCC_GPIOP_CLK_ENABLE();
  gpio.Pin = GPIO_PIN_15;
  HAL_GPIO_Init(GPIOP, &gpio);

  gpio.Mode = GPIO_MODE_OUTPUT_PP;
  gpio.Speed = GPIO_SPEED_FREQ_LOW;

  gpio.Pin = GPIO_PIN_1;
  HAL_GPIO_Init(GPIOE, &gpio);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_RESET);
  HAL_Delay(10);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_SET);
  HAL_Delay(10);

  gpio.Pin = GPIO_PIN_3;
  HAL_GPIO_Init(GPIOQ, &gpio);
  HAL_GPIO_WritePin(GPIOQ, GPIO_PIN_3, GPIO_PIN_SET);

  gpio.Pin = GPIO_PIN_13;
  HAL_GPIO_Init(GPIOG, &gpio);
  HAL_GPIO_WritePin(GPIOG, GPIO_PIN_13, GPIO_PIN_SET);

  gpio.Pin = GPIO_PIN_6;
  HAL_GPIO_Init(GPIOQ, &gpio);
  HAL_GPIO_WritePin(GPIOQ, GPIO_PIN_6, GPIO_PIN_SET);
}

/* HAL_LTDC + FB rouge — aligne milestone 862acf5 */
static void FSBL_LTDC_Init_Red_Milestone862acf5(void)
{
  LTDC_LayerCfgTypeDef layer = {0};

  hltdc.Instance = LTDC;
  hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
  hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

  hltdc.Init.HorizontalSync     = FSBL_LCD_HSYNC - 1U;
  hltdc.Init.AccumulatedHBP     = FSBL_LCD_HSYNC + FSBL_LCD_HBP - 1U;
  hltdc.Init.AccumulatedActiveW = FSBL_LCD_HSYNC + FSBL_LCD_WIDTH + FSBL_LCD_HBP - 1U;
  hltdc.Init.TotalWidth         = FSBL_LCD_HSYNC + FSBL_LCD_WIDTH + FSBL_LCD_HBP + FSBL_LCD_HFP - 1U;
  hltdc.Init.VerticalSync       = FSBL_LCD_VSYNC - 1U;
  hltdc.Init.AccumulatedVBP     = FSBL_LCD_VSYNC + FSBL_LCD_VBP - 1U;
  hltdc.Init.AccumulatedActiveH = FSBL_LCD_VSYNC + FSBL_LCD_HEIGHT + FSBL_LCD_VBP - 1U;
  hltdc.Init.TotalHeigh         = FSBL_LCD_VSYNC + FSBL_LCD_HEIGHT + FSBL_LCD_VBP + FSBL_LCD_VFP - 1U;

  hltdc.Init.Backcolor.Blue  = 0;
  hltdc.Init.Backcolor.Green = 0;
  hltdc.Init.Backcolor.Red   = 0;

  if (HAL_LTDC_Init(&hltdc) != HAL_OK) {
    UART_Print("[FSBL-LTDC] HAL_LTDC_Init FAILED\r\n");
    return;
  }
  UART_Print("[FSBL-LTDC] HAL_LTDC_Init OK\r\n");

  layer.WindowX0        = 0;
  layer.WindowX1      = FSBL_LCD_WIDTH;
  layer.WindowY0        = 0;
  layer.WindowY1      = FSBL_LCD_HEIGHT;
  layer.PixelFormat     = LTDC_PIXEL_FORMAT_RGB565;
  layer.Alpha           = 255;
  layer.Alpha0          = 0;
  layer.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
  layer.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
  layer.FBStartAdress   = FSBL_FB_ADDRESS;
  layer.ImageWidth      = FSBL_LCD_WIDTH;
  layer.ImageHeight     = FSBL_LCD_HEIGHT;
  layer.Backcolor.Blue  = 0;
  layer.Backcolor.Green = 0;
  layer.Backcolor.Red   = 0;

  if (HAL_LTDC_ConfigLayer(&hltdc, &layer, 0) != HAL_OK) {
    UART_Print("[FSBL-LTDC] ConfigLayer FAILED\r\n");
    return;
  }
  UART_Print("[FSBL-LTDC] Layer0 OK FB=0x34200000\r\n");

  {
    volatile uint16_t *fb = (volatile uint16_t *)FSBL_FB_ADDRESS;
    const uint32_t       n = FSBL_LCD_WIDTH * FSBL_LCD_HEIGHT;
    for (uint32_t i = 0; i < n; i++) {
      fb[i] = 0xF800U;
    }
    __DSB();
  }
  UART_Print("[FSBL-LTDC] FB rempli ROUGE (RGB565 0xF800) comme 862acf5\r\n");

  __HAL_LTDC_ENABLE(&hltdc);
}

/* ------------------------------------------------------------------ */
/* Security : RIMC masters + RISC slaves for LTDC (SEC+PRIV)         */
/* Matches ST official examples exactly                               */
/* ------------------------------------------------------------------ */
static void Security_Config(void)
{
  __HAL_RCC_RIFSC_CLK_ENABLE();

  RIMC_MasterConfig_t rimc = {0};
  rimc.MasterCID = RIF_CID_1;
  rimc.SecPriv   = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;

  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1, &rimc);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2, &rimc);

  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC,   RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
}

