jpc007/stm32n6570-dk-first/FSBL/Core/Src/main.c
/* ------------------------------------------------------------------ */
/* Enable SRAMs for the 3-stage boot chain                            */
/*   SRAM1 : AppliSecure code+data (0x34000000, already active)       */
/*   SRAM2 : AppliNonSecure code+data (0x24100000)                    */
/*   SRAM3+SRAM4 : Framebuffer LTDC (0x24200000)                      */
/* ------------------------------------------------------------------ */
static void SRAM_Enable(void)
{
  RAMCFG_HandleTypeDef hramcfg = {0};

  __HAL_RCC_AXISRAM2_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();

  hramcfg.Instance = RAMCFG_SRAM2_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);

  hramcfg.Instance = RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);

  hramcfg.Instance = RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

/* ------------------------------------------------------------------ */
/* Jump to AppliSecure at APPLI_SECURE_ADDR (0x34000400)              */
/* Reads MSP + Reset_Handler from the vector table, validates, jumps. */
/* ------------------------------------------------------------------ */
static void Jump_To_AppliSecure(void)
{
  typedef void (*pFunc)(void);

  uint32_t appli_msp   = *(__IO uint32_t *)(APPLI_SECURE_ADDR);
  uint32_t appli_reset = *(__IO uint32_t *)(APPLI_SECURE_ADDR + 4U);

  UART_Print("[FSBL] Vector @0x34000400 : MSP=");
  /* Quick hex print for diagnostics */
  {
    static const char hex[] = "0123456789ABCDEF";
    char buf[11];
    buf[0] = '0'; buf[1] = 'x';
    for (int i = 0; i < 8; i++) buf[2+i] = hex[(appli_msp >> (28-i*4)) & 0xFU];
    buf[10] = '\0';
    UART_Print(buf);
    UART_Print(" Reset=");
    for (int i = 0; i < 8; i++) buf[2+i] = hex[(appli_reset >> (28-i*4)) & 0xFU];
    UART_Print(buf);
    UART_Print("\r\n");
  }

  /* Sanity check : MSP must be in SRAM range, Reset in code range */
  if ((appli_msp & 0xFF000000U) != 0x34000000U ||
      (appli_reset & 0xFF000000U) != 0x34000000U)
  {
    UART_Print("[FSBL] ERROR: invalid AppliSecure vectors!\r\n");
    while (1) { HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_0); HAL_Delay(100); }
  }

  UART_Print("[FSBL] Jumping to AppliSecure...\r\n");
  /* Small delay to let UART flush */
  HAL_Delay(10);

  SCB->VTOR = APPLI_SECURE_ADDR;
  __set_MSP(appli_msp);
  ((pFunc)appli_reset)();

  /* Should never return */
  while (1) {}
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* ---- DIAGNOSTIC ULTRA-PRECOCE : LED VERTE via CMSIS direct ---- */
  /* Confirme que le FSBL demarre reellement (avant HAL_Init).       */
  RCC->AHB4ENSR = RCC_AHB4ENR_GPIODEN;   /* clock GPIOD ON (SET register) */
  __DSB();
  GPIOD->MODER = (GPIOD->MODER & ~(3UL << (0*2))) | (1UL << (0*2)); /* PD0 output */
  GPIOD->BSRR  = (1UL << 0);             /* PD0 HIGH = LED VERTE            */
  /* La LED restera ON pendant toute la sequence MX_xxx_Init + boot.  */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_I2C1_Init();
  MX_I2C2_Init();
  MX_MDF1_Init();
  MX_SAI1_Init();
  MX_SDMMC2_SD_Init();
  MX_UCPD1_Init();
  MX_USART1_UART_Init();
  MX_USB1_OTG_HS_HCD_Init();
  MX_USB2_OTG_HS_HCD_Init();
  MX_XSPI1_Init();
  MX_XSPI2_Init();
  /* USER CODE BEGIN 2 */

  /* ============================================================
   * PHASE 2a — FSBL : LCD ROUGE HAL (milestone git 862acf5), puis AppliSecure
   *
   * LED VERTE = FSBL OK. LCD rouge = meme pipeline HAL+FB@0x34200000 que la
   * milestone; pause 3 s pour verifier avant le saut Secure.
   * ============================================================ */
  {
    /* LED verte (PD0) */
    GPIO_InitTypeDef gpio = {0};
    __HAL_RCC_GPIOD_CLK_ENABLE();
    gpio.Pin   = GPIO_PIN_0;
    gpio.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio.Pull  = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &gpio);
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
  }

  USART2_Init();
  UART_Print("\r\n=== [1/3 FSBL] Phase 2a ===\r\n");
  UART_PrintResetCause();

  Security_Config();
  UART_Print("[OK] Security_Config\r\n");

  /* Diagnostic SRAM2 AVANT enable */
  UART_Print("[FSBL] SRAM2 @0x34100400 BEFORE enable: ");
  UART_PrintHex32(*(volatile uint32_t *)0x34100400);
  UART_Print(" ");
  UART_PrintHex32(*(volatile uint32_t *)0x34100404);
  UART_Print("\r\n");

  SRAM_Enable();
  UART_Print("[OK] SRAM2+SRAM3+SRAM4 enabled\r\n");

  /* Diagnostic SRAM2 APRES enable */
  UART_Print("[FSBL] SRAM2 @0x34100400 AFTER enable:  ");
  UART_PrintHex32(*(volatile uint32_t *)0x34100400);
  UART_Print(" ");
  UART_PrintHex32(*(volatile uint32_t *)0x34100404);
  UART_Print("\r\n");

  UART_Print("[FSBL] LCD HAL ref 862acf5 (ROUGE)...\r\n");
  FSBL_LTDC_ClockConfig();
  FSBL_LTDC_Init_Red_Milestone862acf5();
  UART_Print("[FSBL] Pause 3s - ecran ROUGE - puis saut AppliSecure\r\n");
  HAL_Delay(3000);

  UART_Print("[1/3 FSBL] -> AppliSecure\r\n");
  Jump_To_AppliSecure();
  /* Never reached */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_0);  /* LED verte blink */
    HAL_Delay(500);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}
/* USER CODE BEGIN CLK 1 */
/* USER CODE END CLK 1 */

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the System Power Supply
  */
  if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK)
  {
    Error_Handler();
  }

